[
  {
    "devModule": "Main Dashboard",
    "devName": "Cedrick Joseph H. Mariano",
    "devRole": "Full Stack Developer",
    "devImage": "Images/devs/MARIANO.jpg",
    "devDesc": "As the frontend developer of the PUPSJ SIS project, Cedrick is responsible for designing and implementing user interfaces that are both intuitive and responsive. He works closely with the backend and database teams to ensure a seamless user experience across various modules, including the Dashboard, About section, School Calendar, and Profile."
  },
  {
    "devModule": "Main Dashboard",
    "devName": "Borgy Misael K. Palermo",
    "devRole": "Database Administrator (DBA)",
    "devImage": "Images/devs/PALERMO.jpg",
    "devDesc": "Handles server-side logic and integration with databases."
  },
  {
    "devModule": "Main Dashboard",
    "devName": "Rj Jack A. Florida",
    "devRole": "Project Manager",
    "devImage": "Images/PUPSJ.png",
    "devDesc": "Handles server-side logic and integration with databases."
  },
  {
    "devModule": "Main Dashboard",
    "devName": "Harold Prince E. dela Pena",
    "devRole": "Full Stack Developer",
    "devImage": "Images/PUPSJ.png",
    "devDesc": "Handles server-side logic and integration with databases."
  },
  {
    "devModule": "Grading",
    "devName": "Micah Athena D. Bugayong",
    "devRole": "UI/UX Designer",
    "devImage": "Images/devs/BUGAYONG.jpg",
    "devDesc": "She assisted in developing the Student View Module by designing and coding intuitive, responsive front-end components to improve the student experience when accessing academic records and grades. She also ensured a smooth interface and reliable functionality through thorough testing and bug fixing to meet quality standards."
  },
  {
    "devModule": "Grading",
    "devName": "Sandra Marie O. Francisco",
    "devRole": "Backend Developer",
    "devImage": "Images/devs/FRANCISCO.jpg",
    "devDesc": "She handles most of the programming side for the Grades module. She makes sure student grades are stored, calculated, and retrieved correctly. She works with the team to keep everything secure and running smoothly."
  },
  {
    "devModule": "Grading",
    "devName": "Rizza Mae Y. Gonzales",
    "devRole": "Frontend Developer",
    "devImage": "Images/devs/GONZALES.jpg",
    "devDesc": "She also designs the part of the Grades module that users see. She makes sure the grades are easy to view and the page works well on all devices. She works along the backend team to keep the information up to date."
  },
  {
    "devModule": "Grading",
    "devName": "Cydoel Tomas",
    "devRole": "Frontend and Backend Developer",
    "devImage": "Images/devs/GONZALES.jpg",
    "devDesc": "Designed and implemented the Grading Module interface, including CSS styling and key functional components. Established a secure cloud database connection to enable seamless data retrieval and updates for grading operations. Thoroughly tested and ensured the functionality of all GUI elements, delivering a user-friendly and efficient grading experience."
  },
  {
    "devModule": "Registration",
    "devName": "Tyronne Jake S. Medina",
    "devRole": "Backend Developer",
    "devImage": "Images/PUP Logo.png",
    "devDesc": "As the backend developer for the PUPSJ SIS project, Tyronne is responsible for building and maintaining the server-side logic of the registration module. He ensures that data is securely processed, stored, and retrieved while integrating seamlessly with the database. Tyronne works closely with both the frontend and database teams to guarantee reliable performance and smooth functionality throughout the registration process."
  },
  {
    "devModule": "Registration",
    "devName": "Jim Russell C. Tejoso",
    "devRole": "Database Admin",
    "devImage": "Images/devs/TEJOSO.jpg",
    "devDesc": "Manages the payment database and ensures data integrity."
  },
  {
    "devModule": "Payment",
    "devName": "Liam Cruz",
    "devRole": "Backend Developer",
    "devImage": "Images/PUP Logo.png",
    "devDesc": "Develops backend APIs and payment processing logic."
  },
  {
    "devModule": "Room Assignment",
    "devName": "Vann Augustine J. Sajulan",
    "devRole": "Frontend Developer",
    "devImage": "Images/devs/SAJULAN.jpg",
    "devDesc": "I worked as the frontend developer for the Room Assignment module of our system. I focused on the design and layout, choosing the right colors, fonts, and overall look to make the system clear and easy to use. I made sure the interface is user-friendly and works well for anyone using it. I also worked with the system’s data and functions."
  },
  {
    "devModule": "Room Assignment",
    "devName": "Eunice Marie S. Marquez",
    "devRole": "UI/UX Designer",
    "devImage": "Images/devs/SAJULAN.jpg",
    "devDesc": "I worked as the frontend developer for the Room Assignment module of our system. I focused on the design and layout, choosing the right colors, fonts, and overall look to make the system clear and easy to use. I made sure the interface is user-friendly and works well for anyone using it. I also worked with the system’s data and functions."
  },
  {
    "devModule": "Room Assignment",
    "devName": "Jesalyn Anne S. Segotier",
    "devRole": "Documentation Analyst",
    "devImage": "Images/devs/SEGOTIER.jpg",
    "devDesc": "Jesalyn creates and updates clear, easy-to-follow documentation for the Room Assignment module. She ensures that all instructions and records are accurate and accessible, helping users understand and navigate the system effectively. Her work supports smooth classroom scheduling and efficient system use.\n"
  }
]